EDT.СЭ_Доработки/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3404cb9a-92ea-42b9-9086-ad481dbc27d7">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="92fb5452-6c85-4d20-915a-3faee12eda7d">
    <name>ТипДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="62e84758-ebd8-4b0e-8041-10d281b0efd1">
    <name>СЭ_ЧислоНомераДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b7c6d994-38af-4143-83f1-344ed241e38b">
    <name>СЭ_ТипДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ebdebeb0-c9c8-4a30-a8f6-e775ddbbb151">
    <name>СЭ_РучнойВводНомераДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f5c2fe7d-963d-45ea-aab5-dc5c03312402">
    <name>СЭ_ГодНомераДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a7ed73d5-070d-4d33-8879-54d3538b69d2">
    <name>СЭ_ДатаОкончания_ТД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

EDT.СЭ_Доработки/src/Catalogs/СЭ_ПриложенияКДоговору/СЭ_ПриложенияКДоговору.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b84cba40-8f7b-485f-a516-f05522faefb9">
  <name>СЭ_ПриложенияКДоговору</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="f137584a-85bb-45fe-b680-eb4583e76ea3">
    <name>ДействияНадОборудованием</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="03a977d8-f9d7-49d7-b965-0eca0641c0d6">
      <name>ПериодОбслуживания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="30cc86e2-636f-47e5-9c28-9ddfdbda169c">
      <name>ДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="09b4795a-4acb-4506-b9e0-658738aef267">
      <name>СерийныйНомерОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c208b561-612c-4b1c-8870-893babf000ee">
      <name>ДатаПередачи</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d8661219-d78d-4722-a96a-3409c20c9a37">
      <name>Местонахождение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f0b4ff0e-2c91-4dd7-b135-d6670bfb2af0">
      <name>ДатаВводаВЭксплуатацию</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6bb8a63b-a8d6-4832-9a6a-9425f3073de5">
      <name>СрокГарантии</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e11b9e75-fdd6-4ec7-93c5-9e6a57a14346">
      <name>ТТН</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2bb644df-a7c0-447d-91d7-e41847033c1a">
      <name>Валюта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT.СЭ_Доработки/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
&После("ПриСозданииНаСервере")
Процедура СЭ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СЭ_СоздатьРеквизитыФормы();
	СЭ_СоздатьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
&После("ПриОткрытии")
Процедура СЭ_ПриОткрытии(Отказ)
	
	//СЭ+ Евгений [16920]
	СЭ_ОбщегоНазначенияКлиент.ЗаполнитьКоманднуюПанельТаблицыСтандартнымиКнопками(ЭтаФорма, "СЭ_ПриложенияКДоговору", Истина);
	СЭ_ОбщегоНазначенияКлиент.ЗаполнитьКоманднуюПанельТаблицыСтандартнымиКнопками(ЭтаФорма, "СЭ_ВидыДействий");
	СЭ_ОбщегоНазначенияКлиент.ЗаполнитьКоманднуюПанельТаблицыСтандартнымиКнопками(ЭтаФорма, "СЭ_Тендер");

	СЭ_ОбщегоНазначенияКлиент.ЗаполнитьКоманднуюПанельТаблицыСтандартнымиКнопками(ЭтаФорма, "СЭ_ЗаданияИнженеру");
	СЭ_ОбщегоНазначенияКлиент.ЗаполнитьКоманднуюПанельТаблицыСтандартнымиКнопками(ЭтаФорма, "СЭ_АктыВыполненныхРабот");
	СЭ_ОбщегоНазначенияКлиент.ЗаполнитьКоманднуюПанельТаблицыСтандартнымиКнопками(ЭтаФорма, "СЭ_ДефектныеАкты");
	
	СЭ_ОбщегоНазначенияКлиент.ЗаполнитьКоманднуюПанельТаблицыСтандартнымиКнопками(ЭтаФорма, "СЭ_АктыЕРП", Истина);
	СЭ_ОбщегоНазначенияКлиент.ЗаполнитьКоманднуюПанельТаблицыСтандартнымиКнопками(ЭтаФорма, "СЭ_ЗапланированныеДействия", Истина);
	//СЭ- Евгений [16920]
	
КонецПроцедуры

&НаКлиенте
&После("ОбработкаОповещения")
Процедура СЭ_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//СЭ+ Евгений [16920]
	Если ИмяСобытия = "Запись_РегистрСведенийСостоянияОригиналовПервичныхДокументов" Тогда
		Объект.СЭ_ДатаВозвратаДоговора = СЭ_ПолучитьДатуВозвратаИзРегистраСостоянияОригиналов(Объект.Ссылка, Объект.СЭ_ДатаВозвратаДоговора);
		Модифицированность = Истина;
	КонецЕсли;           
	//СЭ- Евгений [16920]
	
КонецПроцедуры

&НаСервере
Процедура СЭ_СоздатьРеквизитыФормы()
                
	ДинамическийСписок1 = Новый РеквизитФормы("СЭ_ОборудованиеПоПриложению", Новый ОписаниеТипов("ДинамическийСписок"));
	ДинамическийСписок2 = Новый РеквизитФормы("СЭ_ЗапланированныеДействия", Новый ОписаниеТипов("ДинамическийСписок"));
    ДинамическийСписок3 = Новый РеквизитФормы("СЭ_АктыЕРП", Новый ОписаниеТипов("ДинамическийСписок"));
    ДинамическийСписок4 = Новый РеквизитФормы("СЭ_ПриложенияКДоговору", Новый ОписаниеТипов("ДинамическийСписок"));
   
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(ДинамическийСписок1);
	ДобавляемыеРеквизиты.Добавить(ДинамическийСписок2);
	ДобавляемыеРеквизиты.Добавить(ДинамическийСписок3);
    ДобавляемыеРеквизиты.Добавить(ДинамическийСписок4);

	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ЗадатьЗапросДинСписка("СЭ_ОборудованиеПоПриложению");
	ЗадатьЗапросДинСписка("СЭ_ЗапланированныеДействия");
	ЗадатьЗапросДинСписка("СЭ_АктыЕРП");
	ЗадатьЗапросДинСписка("СЭ_ПриложенияКДоговору");
		
КонецПроцедуры

&НаСервере
Процедура ЗадатьЗапросДинСписка(ИмяДинСписка)
	
	РеквизитДС = ЭтаФорма[ИмяДинСписка];
	РеквизитДС.ПроизвольныйЗапрос = Истина;
	
	РеквизитУсловие = "Договор"; //если не произвольный запрос и надо сделать отбор на договор
	ТекстЗапроса	= "";        //если произвольный запрос то пишем свой текст запроса
	ОсновнаяТаблица = "";        //если произвольный запрос то можно указать основную таблицу для отображение типовых команд на создание элементов
		
	//Задаём текст запроса
	Если ИмяДинСписка = "СЭ_ОборудованиеПоПриложению" Тогда
		
		#Область ТекстЗапроса_ОборудованиеПоПриложению
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО КАК Оборудование,
		|	СЭ_ПриложенияКДоговору.СерийныйНомерОборудования КАК СерийныйНомерОборудования,
		|	СЭ_ПриложенияКДоговору.Местонахождение КАК Местонахождение,
		|	СЭ_ПриложенияКДоговору.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
		|	СЭ_ПриложенияКДоговору.ДатаОкончания КАК ДатаОкончания,
		|	СЭ_ПриложенияКДоговору.СрокГарантии КАК СрокГарантии,
		|	СЭ_ПриложенияКДоговору.ДатаПередачи КАК ДатаПередачи,
		|	СЭ_ПриложенияКДоговору.ПериодОбслуживания КАК ПериодОбслуживания,
		|	СЭ_ПриложенияКДоговору.ТТН КАК ТТН,
		|	СЭ_ПриложенияКДоговору.Валюта КАК Валюта
		|ИЗ
		|	Справочник.СЭ_ПриложенияКДоговору.ДействияНадОборудованием КАК СЭ_ПриложенияКДоговору
		|ГДЕ
		|	СЭ_ПриложенияКДоговору.Ссылка = &Ссылка";
		
		//реквизит СЭ_Оборудование в расширении СмартДеск
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕОПРЕДЕЛЕНО", "СЭ_ПриложенияКДоговору.СЭ_Оборудование");
		
		#КонецОбласти
		
	ИначеЕсли ИмяДинСписка = "СЭ_ЗапланированныеДействия" Тогда
		
		#Область ТекстЗапроса_ЗапланированныеДействия
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО КАК Оборудование,
		|	СЭ_ЗапланированныеДействия.Регистратор КАК Регистратор,
		|	СЭ_ЗапланированныеДействия.ВидДействия КАК ВидДействия,
		|	СЭ_ЗапланированныеДействия.ДатаПлан КАК ДатаПлан,
		|	СЭ_ЗапланированныеДействия.ЧтоСделать КАК ЧтоСделать,
		|	СЭ_ЗапланированныеДействия.Исполнитель КАК Исполнитель,
		|	СЭ_ЗапланированныеДействия.Регистратор.СерийныйНомерОборудования КАК СерийныйНомерОборудования,
		|	СЭ_ЗапланированныеДействия.Регистратор.Местонахождения КАК Местонахождения,
		|	СЭ_ЗапланированныеДействия.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СЭ_ЗапланированныеДействия КАК СЭ_ЗапланированныеДействия
		|ГДЕ
		|	СЭ_ЗапланированныеДействия.Клиент = &Клиент
		|
		|СГРУППИРОВАТЬ ПО
		|	СЭ_ЗапланированныеДействия.Статус,
		|	СЭ_ЗапланированныеДействия.ДатаПлан,
		|	СЭ_ЗапланированныеДействия.Исполнитель,
		|	СЭ_ЗапланированныеДействия.ЧтоСделать,
		|	СЭ_ЗапланированныеДействия.Регистратор,
		|	СЭ_ЗапланированныеДействия.ВидДействия,
		|	СЭ_ЗапланированныеДействия.Регистратор.СерийныйНомерОборудования,
		|	СЭ_ЗапланированныеДействия.Регистратор.Местонахождения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПлан";	
		
		//реквизит СЭ_Оборудование в расширении СмартДеск
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕОПРЕДЕЛЕНО", "СЭ_ЗапланированныеДействия.Регистратор.СЭ_Оборудование");
		
		#КонецОбласти
		
	ИначеЕсли ИмяДинСписка = "СЭ_АктыЕРП" Тогда
		
		#Область ТекстЗапроса_АктыЕРП
		
		РеквизитДС.ОсновнаяТаблица = "Документ.АктВыполненныхРабот";
		РеквизитДС.ПроизвольныйЗапрос = Ложь; // Для создания элементов нужно, чтобы это был штатный список
		
		#КонецОбласти
		
	ИначеЕсли ИмяДинСписка = "СЭ_ПриложенияКДоговору" Тогда
		
		#Область ТекстЗапроса_ПриложенияКДоговору
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СЭ_ПриложенияКДоговору.Ссылка КАК Ссылка,
		|	0 КАК Сумма,
		|	ВЫБОР
		|		КОГДА СЭ_ПриложенияКДоговору.ДатаВозвратаПриложения <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВозвратПриложения,
		|	СЭ_ПриложенияКДоговору.Владелец КАК Владелец,
		|	СЭ_ПриложенияКДоговору.Наименование КАК Наименование,
		|	СЭ_ПриложенияКДоговору.НомерПриложения КАК НомерПриложения,
		|	СЭ_ПриложенияКДоговору.ДатаПриложения КАК ДатаПриложения,
		|	СЭ_ПриложенияКДоговору.ДействуетС КАК ДействуетС,
		|	СЭ_ПриложенияКДоговору.ДействуетПо КАК ДействуетПо,
		|	СЭ_ПриложенияКДоговору.ДатаВозвратаПриложения КАК ДатаВозвратаПриложения,
		|	СЭ_ПриложенияКДоговору.СтадияПодписания КАК СтадияПодписания,
		|	СЭ_ПриложенияКДоговору.Прейскурант КАК Прейскурант,
		|	СЭ_ПриложенияКДоговору.Примечание КАК Примечание
		|ИЗ
		|	Справочник.СЭ_ПриложенияКДоговору КАК СЭ_ПриложенияКДоговору
		|ГДЕ
		|	СЭ_ПриложенияКДоговору.Владелец = &Владелец";
		
		
		ОсновнаяТаблица = "Справочник.СЭ_ПриложенияКДоговору";
		
		РеквизитДС.УстановитьОбязательноеИспользование("Владелец", Истина);

		#КонецОбласти
		
	Иначе
		
		Сообщить(СтрШаблон("Не установлены настройки для дин. списка %1", ИмяДинСписка));
		Возврат;
		
	КонецЕсли;
	
	Если РеквизитДС.ПроизвольныйЗапрос Тогда
		
		//Устанавливаем текст запроса
		РеквизитДС.ТекстЗапроса = ТекстЗапроса;
		
		//Делаем ссылку всегда "Использовать всегда"
		РеквизитДС.УстановитьОбязательноеИспользование("Ссылка", Истина);
		
		//Указываем основную таблицу если надо создавать новые элементы из дин списка
		Если НЕ ПустаяСтрока(ОсновнаяТаблица) Тогда
			РеквизитДС.ОсновнаяТаблица = ОсновнаяТаблица;
		КонецЕсли;
		
	Иначе
		
		//Типовые отборы на договор если не произвольный запрос
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(РеквизитДС, РеквизитУсловие, Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		Иначе	
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(РеквизитДС, "Ссылка"
																		, Неопределено
																		, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		КонецЕсли;

	КонецЕсли;
	
	//Установка параметров
	Если ИмяДинСписка = "СЭ_ОборудованиеПоПриложению" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РеквизитДС, "Ссылка", Неопределено, Истина);	
	ИначеЕсли ИмяДинСписка = "СЭ_ЗапланированныеДействия" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РеквизитДС, "Клиент", Объект.Партнер, Истина);	
	ИначеЕсли ИмяДинСписка = "СЭ_ПриложенияКДоговору" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РеквизитДС, "Владелец", Объект.Ссылка, Истина);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СЭ_СоздатьЭлементыФормы()
	
	//СЭ+ Евгений [16920]
	
	//Номером договора (генерируется при записи если не ручной ввод)		
	нЭлемент = Элементы.Вставить("СЭ_РучнойВводНомераДоговора", Тип("ПолеФормы"), Элементы.ГруппаНомерДата); 
	нЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	нЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	нЭлемент.ПутьКДанным = "Объект.СЭ_РучнойВводНомераДоговора";
    нЭлемент.УстановитьДействие("ПриИзменении", "СЭ_РучнойВводНомераДоговораПриИзменении");
	
	#Область Прочие_Реквизиты
	
	//Группа Прочие реквизиты
	нГруппа = Элементы.Добавить("СЭ_ГруппаПрочиеРеквизиты", Тип("ГруппаФормы"), Элементы.СтраницаОсновное);
	нГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	нГруппа.Заголовок = "";
	нГруппа.ОтображатьЗаголовок = Ложь;
	нГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	нГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	//ДатаВозвратаДоговора
	нЭлемент = Элементы.Вставить("СЭ_ДатаВозвратаДоговора", Тип("ПолеФормы"), Элементы.СЭ_ГруппаПрочиеРеквизиты); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_ДатаВозвратаДоговора";
	
	//Сроки
	нГруппа = Элементы.Добавить("СЭ_ГруппаПрочиеРеквизитыСроки", Тип("ГруппаФормы"), Элементы.СЭ_ГруппаПрочиеРеквизиты);
	нГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	нГруппа.Заголовок = "";
	нГруппа.ОтображатьЗаголовок = Ложь;
	нГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	нГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;

	нЭлемент = Элементы.Вставить("СЭ_СрокНаправленияСпециалистаСМоментаПолученияЗаявки", Тип("ПолеФормы"), Элементы.СЭ_ГруппаПрочиеРеквизитыСроки); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_СрокНаправленияСпециалистаСМоментаПолученияЗаявки";

	нЭлемент = Элементы.Вставить("СЭ_СрокВыполнениРемонтаСМоментаПолученияЗаявки", Тип("ПолеФормы"), Элементы.СЭ_ГруппаПрочиеРеквизитыСроки); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_СрокВыполнениРемонтаСМоментаПолученияЗаявки";
	
	нЭлемент = Элементы.Вставить("СЭ_СрокГарантииНаВыполненныеРаботы", Тип("ПолеФормы"), Элементы.СЭ_ГруппаПрочиеРеквизитыСроки); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_СрокГарантииНаВыполненныеРаботы";

	нЭлемент = Элементы.Вставить("СЭ_СрокГарантииНаУстановленныЗЧ", Тип("ПолеФормы"), Элементы.СЭ_ГруппаПрочиеРеквизитыСроки); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_СрокГарантииНаУстановленныЗЧ";

	#КонецОбласти
	
	#Область ТипДоговора_Реквизиты 
	
	//Группа Тип Договора
	нГруппа = Элементы.Вставить("СЭ_ГруппаТипДоговора", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛево, Элементы.Наименование);
	нГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	нГруппа.Заголовок = "";
	нГруппа.ОтображатьЗаголовок = Ложь;
	нГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	нГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	//Тип договора
	нЭлемент = Элементы.Вставить("СЭ_ТипДоговора", Тип("ПолеФормы"), Элементы.СЭ_ГруппаТипДоговора); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_ТипДоговора";
	нЭлемент.УстановитьДействие("ПриИзменении", "СЭ_ТипДоговораПриИзменении");
	
	нЭлемент = Элементы.Вставить("СЭ_ДатаОкончания_ТД", Тип("ПолеФормы"), Элементы.СЭ_ГруппаТипДоговора); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	нЭлемент.ПутьКДанным = "Объект.СЭ_ДатаОкончания_ТД";

	//Реквизиты связаные с типом договора
	нГруппа = Элементы.Добавить("СЭ_ГруппаРеквизитыТипаДоговора", Тип("ГруппаФормы"), Элементы.СЭ_ГруппаТипДоговора);
	нГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	нГруппа.Заголовок = "";
	нГруппа.ОтображатьЗаголовок = Ложь;
	нГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	нГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	нЭлемент = Элементы.Вставить("СЭ_Сумма_ТД", Тип("ПолеФормы"), Элементы.СЭ_ГруппаРеквизитыТипаДоговора); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	нЭлемент.ПутьКДанным = "Объект.СЭ_Сумма_ТД";
	нЭлемент.Ширина	= 10;
	нЭлемент.УстановитьДействие("ПриИзменении", "СЭ_Сумма_ТДПриИзменении");
	
	нЭлемент = Элементы.Вставить("СЭ_СуммаНДС_ТД", Тип("ПолеФормы"), Элементы.СЭ_ГруппаРеквизитыТипаДоговора); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	нЭлемент.ПутьКДанным = "Объект.СЭ_СуммаНДС_ТД";
   	нЭлемент.Ширина	= 10;
	нЭлемент.ТолькоПросмотр = Истина;
		                       	
	//Команды ТЧ
	НоваяКоманда           = Команды.Добавить("СЭ_СуммаДоговора");
	НоваяКоманда.Заголовок = "Сумма договора";
	НоваяКоманда.Подсказка = "Заполнить сумму договора по данным документа";
	НоваяКоманда.Действие  = "СЭ_СуммаДоговора";
	                                                                                     
	НовыйЭлементКоманда = Элементы.Вставить("СЭ_СуммаДоговора", Тип("КнопкаФормы"), Элементы.СЭ_ГруппаРеквизитыТипаДоговора);
	НовыйЭлементКоманда.ИмяКоманды 	= "СЭ_СуммаДоговора";
	НовыйЭлементКоманда.Отображение = ОтображениеКнопки.Текст;
	
	#КонецОбласти
	
	//По просьбе Владимира переносим гиперссылку по ориналам под статус
	ГиперрсылкаОригинала = Элементы.Найти("ДекорацияСостояниеОригинала");
	Если ГиперрсылкаОригинала <> Неопределено Тогда
		Элементы.Переместить(ГиперрсылкаОригинала, Элементы.ГруппаШапкаПраво);
	КонецЕсли;
	
	//Страница "Приложение к Договору"
	СЭ_СозданиеЭлементов_ПриложениеКДоговору();
		
	//Страница "Тендер"
	СЭ_СозданиеЭлементов_Тендер();
	
	//Настройка видимости
	СЭ_УстановитьВидимостьПоТипуДоговора();
	//СЭ- Евгений [16920]
	
КонецПроцедуры

//СЭ+ Евгений [16920]
&НаСервере
Процедура СЭ_СозданиеЭлементов_ПриложениеКДоговору()

	нСтраница = Элементы.Вставить("СЭ_СтраницаПриложенияКДоговору", Тип("ГруппаФормы"), Элементы.ГруппаСтраницы, Элементы.СтраницаКомментарий);
	нСтраница.Вид = ВидГруппыФормы.Страница;
	нСтраница.Заголовок = "Приложение к Договору";
	
	//Разделим старницу на верх и низ и верх на лево и право
	нГруппа = Элементы.Вставить("СЭ_ГруппаПКД_Верх", Тип("ГруппаФормы"), Элементы.СЭ_СтраницаПриложенияКДоговору);
	нГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	нГруппа.ОтображатьЗаголовок = Ложь;
	нГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	нГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	нГруппа.Высота		= 25;
	
	нГруппа = Элементы.Вставить("СЭ_ГруппаПКД_ВерхЛево", Тип("ГруппаФормы"), Элементы.СЭ_ГруппаПКД_Верх);
	нГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	нГруппа.ОтображатьЗаголовок = Ложь;
	нГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	нГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;

    нГруппа = Элементы.Вставить("СЭ_ГруппаПКД_ВерхПраво", Тип("ГруппаФормы"), Элементы.СЭ_ГруппаПКД_Верх);
	нГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	нГруппа.ОтображатьЗаголовок = Ложь;
	нГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	нГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	
   	нГруппа = Элементы.Вставить("СЭ_ГруппаПКД_Низ", Тип("ГруппаФормы"), Элементы.СЭ_СтраницаПриложенияКДоговору);
	нГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	нГруппа.ОтображатьЗаголовок = Ложь;
	нГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	нГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
   
	//Делаем страницы вверху слева
    нСтраницы = Элементы.Вставить("СЭ_СтраницыПКД_ВерхЛево", Тип("ГруппаФормы"), Элементы.СЭ_ГруппаПКД_ВерхЛево);
	нСтраницы.Вид = ВидГруппыФормы.Страницы;
	
	нСтраница = Элементы.Вставить("СЭ_ПриложенияПКД", Тип("ГруппаФормы"), Элементы.СЭ_СтраницыПКД_ВерхЛево);
	нСтраница.Вид = ВидГруппыФормы.Страница;
	нСтраница.Заголовок = "Приложения";
	
	#Область Таблица_Приложения
	
	ТаблицаФормы = Элементы.Добавить("СЭ_ПриложенияКДоговору", Тип("ТаблицаФормы"), Элементы.СЭ_ПриложенияПКД);
	ТаблицаФормы.ПутьКДанным = "СЭ_ПриложенияКДоговору";
	ТаблицаФормы.Отображение = ОтображениеТаблицы.Список;
	ТаблицаФормы.УстановитьДействие("ПриАктивизацииСтроки", "СЭ_ПриложенияКДоговоруПриАктивизацииСтроки");
	ТаблицаФормы.УстановитьДействие("Выбор", "СЭ_ПриложенияКДоговоруВыбор");
		
	НовыйЭлемент = Элементы.Добавить("СЭ_ПриложенияКДоговору_Приложение", Тип("ПолеФормы"), Элементы.СЭ_ПриложенияКДоговору);
	НовыйЭлемент.ПутьКДанным = "СЭ_ПриложенияКДоговору.Ссылка";
	НовыйЭлемент.Заголовок   = "Наименование";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "СЭ_ПриложенияКДоговору_ПриложениеПриИзменении");
	
	НовыйЭлемент = Элементы.Добавить("СЭ_ПриложенияКДоговору_ВозвратПриложения", Тип("ПолеФормы"), Элементы.СЭ_ПриложенияКДоговору);
	НовыйЭлемент.ПутьКДанным = "СЭ_ПриложенияКДоговору.ВозвратПриложения";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;

	НовыйЭлемент = Элементы.Добавить("СЭ_ПриложенияКДоговору_СрокОкончания", Тип("ПолеФормы"), Элементы.СЭ_ПриложенияКДоговору);
	НовыйЭлемент.ПутьКДанным = "СЭ_ПриложенияКДоговору.ДействуетПо";
	НовыйЭлемент.Заголовок	 = "Срок окончания";
	
	НовыйЭлемент = Элементы.Добавить("СЭ_ПриложенияКДоговору_Сумма", Тип("ПолеФормы"), Элементы.СЭ_ПриложенияКДоговору);
	НовыйЭлемент.ПутьКДанным = "СЭ_ПриложенияКДоговору.Сумма";
	
	НовыйЭлемент = Элементы.Добавить("СЭ_ПриложенияКДоговору_СтатусПодписания", Тип("ПолеФормы"), Элементы.СЭ_ПриложенияКДоговору);
	НовыйЭлемент.ПутьКДанным 	= "СЭ_ПриложенияКДоговору.СтадияПодписания";
	
	#КонецОбласти
	
	нСтраница = Элементы.Вставить("СЭ_ДополнительноПКД", Тип("ГруппаФормы"), Элементы.СЭ_СтраницыПКД_ВерхЛево);
	нСтраница.Вид = ВидГруппыФормы.Страница;
	нСтраница.Заголовок = "Дополнительно";

   	нСтраница = Элементы.Вставить("СЭ_ВидыДействийПКД", Тип("ГруппаФормы"), Элементы.СЭ_СтраницыПКД_ВерхЛево);
	нСтраница.Вид = ВидГруппыФормы.Страница;
	нСтраница.Заголовок = "Виды действий";
	
	#Область Таблица_Виды_Действий
	
	ТаблицаФормы = Элементы.Добавить("СЭ_ВидыДействий", Тип("ТаблицаФормы"), Элементы.СЭ_ВидыДействийПКД);
	ТаблицаФормы.ПутьКДанным = "Объект.СЭ_ВидыДействий";
	ТаблицаФормы.Отображение = ОтображениеТаблицы.Список;
	
    НовыйЭлемент = Элементы.Добавить("СЭ_ВидыДействий_НомерСтроки", Тип("ПолеФормы"), Элементы.СЭ_ВидыДействий);
	НовыйЭлемент.ПутьКДанным = "Объект.СЭ_ВидыДействий.НомерСтроки";
	НовыйЭлемент.Заголовок = "N";
	НовыйЭлемент.Ширина = 2;
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	
	НовыйЭлемент = Элементы.Добавить("СЭ_ВидыДействий_ВидДействия", Тип("ПолеФормы"), Элементы.СЭ_ВидыДействий);
	НовыйЭлемент.ПутьКДанным = "Объект.СЭ_ВидыДействий.ВидДействия";
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	
	#КонецОбласти

	//Делаем страницы вверху справо
    нСтраницы = Элементы.Вставить("СЭ_СтраницыПКД_ВерхПраво", Тип("ГруппаФормы"), Элементы.СЭ_ГруппаПКД_ВерхПраво);
	нСтраницы.Вид = ВидГруппыФормы.Страницы;
	
	нСтраница = Элементы.Вставить("СЭ_ОборудованиеПоПриложениюПКД", Тип("ГруппаФормы"), Элементы.СЭ_СтраницыПКД_ВерхПраво);
	нСтраница.Вид = ВидГруппыФормы.Страница;
	нСтраница.Заголовок = "Оборудование по приложению";
	
	#Область Список_Оборудование
	
	ТаблицаФормы = Элементы.Добавить("СЭ_ОборудованиеПоПриложению", Тип("ТаблицаФормы"), Элементы.СЭ_ОборудованиеПоПриложениюПКД);
	ТаблицаФормы.ПутьКДанным = "СЭ_ОборудованиеПоПриложению";
	ТаблицаФормы.Отображение = ОтображениеТаблицы.Список;
	
	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ОборудованиеПоПриложению_Оборудование", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "СЭ_ОборудованиеПоПриложению.Оборудование";
	
	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ОборудованиеПоПриложению_СерийныйНомерОборудования", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "СЭ_ОборудованиеПоПриложению.СерийныйНомерОборудования";
	
	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ОборудованиеПоПриложению_Местонахождение", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "СЭ_ОборудованиеПоПриложению.Местонахождение";
	
	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ОборудованиеПоПриложению_ДатаВводаВЭксплуатацию", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "СЭ_ОборудованиеПоПриложению.ДатаВводаВЭксплуатацию";
	
	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ОборудованиеПоПриложению_ДатаОкончания", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "СЭ_ОборудованиеПоПриложению.ДатаОкончания";
	
	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ОборудованиеПоПриложению_СрокГарантии", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "СЭ_ОборудованиеПоПриложению.СрокГарантии";
	
	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ОборудованиеПоПриложению_ПериодОбслуживания", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "СЭ_ОборудованиеПоПриложению.ПериодОбслуживания";
	
	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ОборудованиеПоПриложению_ТТН", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "СЭ_ОборудованиеПоПриложению.ТТН";
	#КонецОбласти
	
	//Делаем страницу внизу вкладки
	нСтраницы = Элементы.Вставить("СЭ_СтраницыПКД_Низ", Тип("ГруппаФормы"), Элементы.СЭ_ГруппаПКД_Низ);
	нСтраницы.Вид = ВидГруппыФормы.Страницы;
	
	нСтраница = Элементы.Вставить("СЭ_ЗаплонированныеДействияПКД", Тип("ГруппаФормы"), Элементы.СЭ_СтраницыПКД_Низ);
	нСтраница.Вид = ВидГруппыФормы.Страница;
	нСтраница.Заголовок = "Заплонированные действия";
		
	#Область Таблица_Акты_Выполненных_Работ
	
	нСтраница = Элементы.Вставить("СЭ_АктыВыполненныхРаботПКД", Тип("ГруппаФормы"), Элементы.СЭ_СтраницыПКД_Низ);
	нСтраница.Вид = ВидГруппыФормы.Страница;
	нСтраница.Заголовок = "Акты выполненных работ Драйв";
	
	ТаблицаФормы = Элементы.Добавить("СЭ_АктыВыполненныхРабот", Тип("ТаблицаФормы"), Элементы.СЭ_АктыВыполненныхРаботПКД);
	ТаблицаФормы.ПутьКДанным = "Объект.СЭ_АктыВыполненныхРабот";
	ТаблицаФормы.Отображение = ОтображениеТаблицы.Список;
	
	ТаблицаФормы.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы;
	ТаблицаФормы.АвтоМаксимальнаяВысотаВСтрокахТаблицы = Ложь;
	ТаблицаФормы.МаксимальнаяВысотаВСтрокахТаблицы = 5;

	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_АктыВыполненныхРабот_АктВыполненныхРабот", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "Объект.СЭ_АктыВыполненныхРабот.АктыВыполненныхРабот";
	НоваяКолонкаТаблицы.Вид = ВидПоляФормы.ПолеВвода;

	#КонецОбласти 
	
	#Область Таблица_Акты_ЕРП
	
	нСтраница = Элементы.Вставить("СЭ_АктыЕРППКД", Тип("ГруппаФормы"), Элементы.СЭ_СтраницыПКД_Низ);
	нСтраница.Вид = ВидГруппыФормы.Страница;
	нСтраница.Заголовок = "Акты ЕРП";
	
	ТаблицаФормы = Элементы.Добавить("СЭ_АктыЕРП", Тип("ТаблицаФормы"), Элементы.СЭ_АктыЕРППКД);
	ТаблицаФормы.ПутьКДанным = "СЭ_АктыЕРП";
	ТаблицаФормы.Отображение = ОтображениеТаблицы.Список;
	
	ТаблицаФормы.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы;
	ТаблицаФормы.АвтоМаксимальнаяВысотаВСтрокахТаблицы = Ложь;
	ТаблицаФормы.МаксимальнаяВысотаВСтрокахТаблицы = 5;

	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_АктыЕРП_Ссылка", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "СЭ_АктыЕРП.Ссылка";
    НоваяКолонкаТаблицы.Заголовок	= "Акт";
	
	#КонецОбласти
	
	#Область Таблица_Дефектные_Акты
	
	нСтраница = Элементы.Вставить("СЭ_ДефектныеАктыПКД", Тип("ГруппаФормы"), Элементы.СЭ_СтраницыПКД_Низ);
	нСтраница.Вид = ВидГруппыФормы.Страница;
	нСтраница.Заголовок = "Дефектные акты";
	
	ТаблицаФормы = Элементы.Добавить("СЭ_ДефектныеАкты", Тип("ТаблицаФормы"), Элементы.СЭ_ДефектныеАктыПКД);
	ТаблицаФормы.ПутьКДанным = "Объект.СЭ_ДефектныеАкты";
	ТаблицаФормы.Отображение = ОтображениеТаблицы.Список;
	
	ТаблицаФормы.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы;
	ТаблицаФормы.АвтоМаксимальнаяВысотаВСтрокахТаблицы = Ложь;
	ТаблицаФормы.МаксимальнаяВысотаВСтрокахТаблицы = 5;

	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ДефектныеАктыПКД_ДефектныеАкты", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "Объект.СЭ_ДефектныеАкты.ДефектныеАкты";
	НоваяКолонкаТаблицы.Вид = ВидПоляФормы.ПолеВвода;

	#КонецОбласти
	
	#Область Таблица_Задания_Инженеру
	
	нСтраница = Элементы.Вставить("СЭ_ЗаданияИнженеруПКД", Тип("ГруппаФормы"), Элементы.СЭ_СтраницыПКД_Низ);
	нСтраница.Вид = ВидГруппыФормы.Страница;
	нСтраница.Заголовок = "Задания инженеру";

	ТаблицаФормы = Элементы.Добавить("СЭ_ЗаданияИнженеру", Тип("ТаблицаФормы"), Элементы.СЭ_ЗаданияИнженеруПКД);
	ТаблицаФормы.ПутьКДанным = "Объект.СЭ_ЗаданияИнженеру";
	ТаблицаФормы.Отображение = ОтображениеТаблицы.Список;
	
	ТаблицаФормы.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы;
	ТаблицаФормы.АвтоМаксимальнаяВысотаВСтрокахТаблицы = Ложь;
	ТаблицаФормы.МаксимальнаяВысотаВСтрокахТаблицы = 5;

	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ЗаданияИнженеруПКД_ЗаданияИнженеру", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "Объект.СЭ_ЗаданияИнженеру.ЗаданиеИнженеру";
	НоваяКолонкаТаблицы.Вид = ВидПоляФормы.ПолеВвода;
	
	#КонецОбласти

    #Область Список_Заплаированные_Действия
	
	нСтраница = Элементы.Вставить("СЭ_ЗапланированныеДействияПКД", Тип("ГруппаФормы"), Элементы.СЭ_СтраницыПКД_Низ);
	нСтраница.Вид = ВидГруппыФормы.Страница;
	нСтраница.Заголовок = "Запланированные действия";

    ТаблицаФормы = Элементы.Добавить("СЭ_ЗапланированныеДействия", Тип("ТаблицаФормы"), Элементы.СЭ_ЗапланированныеДействияПКД);
	ТаблицаФормы.ПутьКДанным = "СЭ_ЗапланированныеДействия";
	ТаблицаФормы.УстановитьДействие("Выбор", "СЭ_ЗапланированныеДействияВыбор");
	
	ЭтотОбъект["СЭ_ЗапланированныеДействия"].УстановитьОбязательноеИспользование("Регистратор", Истина);
	
	ТаблицаФормы.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы;
	ТаблицаФормы.АвтоМаксимальнаяВысотаВСтрокахТаблицы = Ложь;
	ТаблицаФормы.МаксимальнаяВысотаВСтрокахТаблицы = 5;
	
	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ЗапланированныеДействия_ВидДействия", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "СЭ_ЗапланированныеДействия.ВидДействия";

	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ЗапланированныеДействия_ДатаПлан", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "СЭ_ЗапланированныеДействия.ДатаПлан";
	НоваяКолонкаТаблицы.Заголовок	= "Плановая дата";
	
	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ЗапланированныеДействия_ЧтоСделать", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "СЭ_ЗапланированныеДействия.ЧтоСделать";

	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ЗапланированныеДействия_Исполнитель", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "СЭ_ЗапланированныеДействия.Исполнитель";

	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ЗапланированныеДействия_Оборудование", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "СЭ_ЗапланированныеДействия.Оборудование";

	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ЗапланированныеДействия_СерийныйНомерОборудования", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "СЭ_ЗапланированныеДействия.СерийныйНомерОборудования";

	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ЗапланированныеДействия_Местонахождения", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "СЭ_ЗапланированныеДействия.Местонахождения";

	НоваяКолонкаТаблицы = Элементы.Добавить("СЭ_ЗапланированныеДействия_Статус", Тип("ПолеФормы"), ТаблицаФормы);
	НоваяКолонкаТаблицы.ПутьКДанным = "СЭ_ЗапланированныеДействия.Статус";

	#КонецОбласти


КонецПроцедуры 

&НаКлиенте
Процедура СЭ_ПриложенияКДоговоруПриАктивизацииСтроки(Элемент)
	
	УстановитьПараметрДинСписка_Оборудование();	

КонецПроцедуры

&НаКлиенте
Процедура СЭ_ПриложенияКДоговоруВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекДанные = Элементы.СЭ_ПриложенияКДоговору.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекДанные.Ссылка);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СЭ_ПриложенияКДоговору_ПриложениеПриИзменении(Элемент)

	УстановитьПараметрДинСписка_Оборудование();	

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрДинСписка_Оборудование(ЗначениеПараметраПриложение = Неопределено)
	
	Если ЗначениеПараметраПриложение = Неопределено Тогда
	
		ТекДанные = Элементы.СЭ_ПриложенияКДоговору.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			ЗначениеПараметраПриложение = ТекДанные.Ссылка;	
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма["СЭ_ОборудованиеПоПриложению"], "Ссылка", ЗначениеПараметраПриложение, Истина);	

КонецПроцедуры

&НаСервере
Процедура СЭ_СозданиеЭлементов_Тендер()

	нСтраница = Элементы.Вставить("СЭ_СтраницаТендер", Тип("ГруппаФормы"), Элементы.ГруппаСтраницы, Элементы.СтраницаКомментарий);
	нСтраница.Вид = ВидГруппыФормы.Страница;
	нСтраница.Заголовок = "Тендер";
	
	СЭ_УстановитьЗаголовокСтраницыТендера();
	
	//Добавляем таблицу Тендер ++++
	НоваяТаблица = Элементы.Добавить("СЭ_Тендер", Тип("ТаблицаФормы"), Элементы.СЭ_СтраницаТендер);
	НоваяТаблица.ПутьКДанным = "Объект.СЭ_Тендер";
	НоваяТаблица.Отображение = ОтображениеТаблицы.Список;
	НоваяТаблица.УстановитьДействие("ПриИзменении", "ТендерПриИзменении");
	НоваяТаблица.УстановитьДействие("Выбор", "ТендерВыбор");
	
    НовыйЭлемент = Элементы.Добавить("СЭ_Тендер_НомерСтроки", Тип("ПолеФормы"), Элементы.СЭ_Тендер);
	НовыйЭлемент.ПутьКДанным = "Объект.СЭ_Тендер.НомерСтроки";
	НовыйЭлемент.Заголовок = "N";
	НовыйЭлемент.Ширина = 2;
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	
	НовыйЭлемент = Элементы.Добавить("СЭ_Тендер_НомерТендера", Тип("ПолеФормы"), Элементы.СЭ_Тендер);
	НовыйЭлемент.ПутьКДанным = "Объект.СЭ_Тендер.Интерес.Тема";
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.Заголовок 	= "Номер тендера";
	НовыйЭлемент.Ширина		= 10;
	//НовыйЭлемент.ТолькоПросмотр = Истина;

	НовыйЭлемент = Элементы.Добавить("СЭ_Тендер_Интерес", Тип("ПолеФормы"), Элементы.СЭ_Тендер);
	НовыйЭлемент.ПутьКДанным = "Объект.СЭ_Тендер.Интерес";
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//Добавляем таблицу Тендер ----


КонецПроцедуры

&НаКлиенте
Процедура ТендерПриИзменении(Элемент)

	СЭ_УстановитьЗаголовокСтраницыТендера();

КонецПроцедуры

&НаСервере
Процедура СЭ_УстановитьЗаголовокСтраницыТендера()

	Элементы.СЭ_СтраницаТендер.Заголовок = СтрШаблон("Тендер (%1)", Объект.СЭ_Тендер.Количество());

КонецПроцедуры

&НаКлиенте
Процедура ТендерВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	Если Поле = Элементы.СЭ_Тендер_НомерТендера Тогда
		ДокументИнтерес = Элемент.ТекущиеДанные.Интерес; 
		Если ЗначениеЗаполнено(ДокументИнтерес) Тогда
			ПоказатьЗначение(, ДокументИнтерес);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СЭ_ЗапланированныеДействияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ДокументЗаявление = Элемент.ТекущиеДанные.Регистратор; 
	Если ЗначениеЗаполнено(ДокументЗаявление) Тогда
		ПоказатьЗначение(, ДокументЗаявление);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура СЭ_РучнойВводНомераДоговораПриИзменении(Элемент)
	
	СЭ_УстановитьДоступностьРедактированияНомера();

КонецПроцедуры

&НаСервере
Процедура СЭ_УстановитьДоступностьРедактированияНомера()
	
	Если Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем") Тогда
		Элементы.Номер.ТолькоПросмотр = НЕ Объект.СЭ_РучнойВводНомераДоговора;	
	Иначе
		Элементы.Номер.ТолькоПросмотр = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СЭ_ДанныеПоТипуДоговораПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		Элемент.ТекущиеДанные.ДатаОкончания = КонецГода(ТекущаяДата());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СЭ_СуммаДоговора(Команда)
	
	Оп = Новый ОписаниеОповещения("СЭ_СуммаДоговораЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.СЭ_ФормаВыбораСуммыДоговора",, ЭтотОбъект,,,, Оп);
	
КонецПроцедуры

&НаКлиенте
Процедура СЭ_СуммаДоговораЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оп = Новый ОписаниеОповещения("СЭ_ВыборДокументаДляЗаполненияСуммы", ЭтотОбъект);
	
	ПараметрыФормы = СЭ_ПолучитьПараметрыФормыВыбора();
	 		
	Если Результат = "Интерес клиента" Тогда
		
		ЗначениеОтбора = Новый Структура();
		ЗначениеОтбора.Вставить("Партнер", Объект.Партнер);
		ЗначениеОтбора.Вставить("ПометкаНаУдаление", Ложь);
		
		ПараметрыФормы.Вставить("Отбор", ЗначениеОтбора);
		    
		ОткрытьФорму("Документ.CRM_Интерес.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,, Оп);	
		
	ИначеЕсли Результат = "Коммерческое предложение клиенту" Тогда
		
		ЗначениеОтбора = Новый Структура();
		ЗначениеОтбора.Вставить("Клиент", Объект.Партнер);
		ЗначениеОтбора.Вставить("Проведен", Истина);
		
		ПараметрыФормы.Вставить("Отбор", ЗначениеОтбора);
		
		ОткрытьФорму("Документ.КоммерческоеПредложениеКлиенту.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,, Оп);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СЭ_ПолучитьПараметрыФормыВыбора()

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РежимВыбора"		, Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
		
    Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура СЭ_ВыборДокументаДляЗаполненияСуммы(Результат, ДопПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	СтруктураРезультата = СЭ_ПолучитьСуммуПоДокументу(Результат);
	Объект.СЭ_Сумма_ТД 		= СтруктураРезультата.Сумма;
    Объект.СЭ_СуммаНДС_ТД 	= СтруктураРезультата.СуммаНДС;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СЭ_ПолучитьСуммуПоДокументу(ДокументСсылка)

	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("Сумма", 0);
	СтруктураРезультата.Вставить("СуммаНДС", 0);
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		СтруктураРезультата.Сумма = ДокументСсылка.ОжидаемаяВыручка;	
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СУММА(КоммерческоеПредложениеКлиентуТовары.СуммаСНДС) КАК Сумма,
			|	КоммерческоеПредложениеКлиентуТовары.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.КоммерческоеПредложениеКлиенту.Товары КАК КоммерческоеПредложениеКлиентуТовары
			|ГДЕ
			|	КоммерческоеПредложениеКлиентуТовары.Ссылка = &Ссылка
			|	И КоммерческоеПредложениеКлиентуТовары.CRM_Утвержден = ИСТИНА
			|
			|СГРУППИРОВАТЬ ПО
			|	КоммерческоеПредложениеКлиентуТовары.Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураРезультата.Сумма = Выборка.Сумма;
		КонецЦикла;
			
	КонецЕсли;
	
	СтруктураРезультата.СуммаНДС = СЭ_РассчитатьСуммаНДС(СтруктураРезультата.Сумма);
		
	Возврат СтруктураРезультата;

КонецФункции 

&НаСервереБезКонтекста
Функция СЭ_РассчитатьСуммаНДС(СуммаДляРасчета)
	
	СуммаНДС = 0;
	
	Если СуммаДляРасчета <> 0 Тогда
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СтавкиНДС.Ссылка КАК Ссылка,
			|	СтавкиНДС.Ставка КАК Ставка
			|ИЗ
			|	Справочник.СтавкиНДС КАК СтавкиНДС
			|ГДЕ
			|	СтавкиНДС.Основная = ИСТИНА
			|	И СтавкиНДС.ПометкаУдаления = ЛОЖЬ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
				
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтавкаНДС = Выборка.Ставка;
			КонецЦикла;
			
			СуммаНДС = СуммаДляРасчета * СтавкаНДС / (100 + СтавкаНДС);
			
		КонецЕсли;
		
	Конецесли;
	
    Возврат СуммаНДС;
	
КонецФункции 

&НаКлиенте
Процедура СЭ_Сумма_ТДПриИзменении(Элемент)

	Объект.СЭ_СуммаНДС_ТД = СЭ_РассчитатьСуммаНДС(Объект.СЭ_Сумма_ТД);	

КонецПроцедуры

&НаСервере
Процедура СЭ_УстановитьВидимостьПоТипуДоговора()
	
	ПризнакВидимость = Ложь;
	Если Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем") Тогда
		ПризнакВидимость = Истина; 
	КонецЕсли;
	
	Элементы.СЭ_ГруппаТипДоговора.Видимость 			= ПризнакВидимость;
	Элементы.СЭ_РучнойВводНомераДоговора.Видимость 		= ПризнакВидимость;
	Элементы.СЭ_СтраницаПриложенияКДоговору.Видимость 	= ПризнакВидимость;
	Элементы.СЭ_СтраницаТендер.Видимость 				= ПризнакВидимость;
	
	////СЭ+ Евгений [16920]  УДАЛИТЬ ПОСЛЕ ПЕРЕНОСА ДОРАБОТОК В РАБОЧУЮ БАЗУ
	//ПризнакВидимость = Ложь;	
	//Элементы.СЭ_РучнойВводНомераДоговора.Видимость 	= ПризнакВидимость;
	//Элементы.СЭ_ГруппаПрочиеРеквизиты.Видимость 	= ПризнакВидимость;
	////СЭ- Евгений [16920]
	
	СЭ_УстановитьДоступностьРедактированияНомера();
	
КонецПроцедуры

&НаКлиенте
&После("ТипДоговораПриИзменении")
Процедура СЭ_ЦельДоговораПриИзменении(Элемент)
	СЭ_УстановитьВидимостьПоТипуДоговора();
КонецПроцедуры 

&НаКлиенте
Процедура СЭ_ТипДоговораПриИзменении(Элемент)
	
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СЭ_ПолучитьДатуВозвратаИзРегистраСостоянияОригиналов(ДоговорСсылка, ДатаВозвратаДоговора)

	Возврат Справочники.ДоговорыКонтрагентов.СЭ_ПолучитьДатуВозвратаИзРегистраСостоянияОригиналов(ДоговорСсылка, ДатаВозвратаДоговора);	

КонецФункции

&НаКлиенте
&После("ПартнерПриИзменении")
Процедура СЭ_ПартнерПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма["СЭ_ЗапланированныеДействия"], "Клиент", Объект.Партнер, Истина);	
КонецПроцедуры

&НаКлиенте 
&После("ПослеЗаписи")
Процедура СЭ_ПослеЗаписиПосле(ПараметрыЗаписи)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма["СЭ_АктыЕРП"], "Договор", Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно,, Истина);
КонецПроцедуры
//СЭ- Евгений [16920]
